-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Окт 12 2022 г., 17:34
-- Версия сервера: 10.4.24-MariaDB
-- Версия PHP: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gkansuz_ci4`
--

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `version` varchar(255) NOT NULL,
  `class` varchar(255) NOT NULL,
  `group` varchar(255) NOT NULL,
  `namespace` varchar(255) NOT NULL,
  `time` int(11) NOT NULL,
  `batch` int(11) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `version`, `class`, `group`, `namespace`, `time`, `batch`) VALUES
(1, '2022-10-12-151644', 'App\\Database\\Migrations\\CreateSubjectsTable', 'default', 'App', 1665588323, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `product_price` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp(),
  `deleted_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `product_name`, `product_price`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'Ruchka 755', 5000, '2022-10-04 11:26:06', '2022-10-04 11:26:33', '2022-10-04 11:26:44'),
(2, 'Ручка 820', 7500, '2022-10-04 11:26:06', '2022-10-04 11:26:33', '2022-10-04 11:26:44'),
(3, '', 8000, '2022-10-05 10:54:04', '2022-10-05 10:54:04', '2022-10-05 10:54:04'),
(4, 'Daftar 96', 8000, '2022-10-05 10:55:03', '2022-10-05 10:55:03', '2022-10-05 10:55:03'),
(5, 'Daftar 96', 8000, '2022-10-05 10:55:37', '2022-10-05 10:55:37', '2022-10-05 10:55:37'),
(6, 'Daftar 96', 8000, '2022-10-05 11:33:20', '2022-10-05 11:33:20', '2022-10-05 11:33:20'),
(7, 'Daftar 96', 8000, '2022-10-11 16:01:49', '2022-10-11 16:01:49', '2022-10-11 16:01:49'),
(8, 'Daftar 96', 8000, '2022-10-11 16:05:26', '2022-10-11 16:05:26', '2022-10-11 16:05:26'),
(9, 'Daftar 96', 8000, '2022-10-11 16:07:25', '2022-10-11 16:07:25', '2022-10-11 16:07:25'),
(10, 'Daftar 96', 8000, '2022-10-11 16:10:56', '2022-10-11 16:10:56', '2022-10-11 16:10:56'),
(11, 'Daftar 96', 8000, '2022-10-11 18:08:19', '2022-10-11 18:08:19', '2022-10-11 18:08:19'),
(12, 'Daftar 96', 8000, '2022-10-11 18:08:25', '2022-10-11 18:08:25', '2022-10-11 18:08:25'),
(13, 'Daftar 96', 8000, '2022-10-11 18:10:05', '2022-10-11 18:10:05', '2022-10-11 18:10:05'),
(14, 'Daftar 96', 8000, '2022-10-11 18:16:23', '2022-10-11 18:16:23', '2022-10-11 18:16:23'),
(15, 'Daftar 96', 8000, '2022-10-11 18:16:26', '2022-10-11 18:16:26', '2022-10-11 18:16:26'),
(16, 'Daftar 96', 8000, '2022-10-11 18:16:59', '2022-10-11 18:16:59', '2022-10-11 18:16:59'),
(17, 'Daftar 96', 8000, '2022-10-11 18:17:00', '2022-10-11 18:17:00', '2022-10-11 18:17:00'),
(18, 'Daftar 96', 8000, '2022-10-11 18:17:01', '2022-10-11 18:17:01', '2022-10-11 18:17:01'),
(19, 'Daftar 96', 8000, '2022-10-11 18:17:26', '2022-10-11 18:17:26', '2022-10-11 18:17:26'),
(20, 'Daftar 96', 8000, '2022-10-11 18:17:30', '2022-10-11 18:17:30', '2022-10-11 18:17:30'),
(21, 'Daftar 96', 8000, '2022-10-11 18:17:32', '2022-10-11 18:17:32', '2022-10-11 18:17:32'),
(22, 'Daftar 96', 8000, '2022-10-11 18:21:12', '2022-10-11 18:21:12', '2022-10-11 18:21:12'),
(23, 'Daftar 96', 8000, '2022-10-11 18:44:26', '2022-10-11 18:44:26', '2022-10-11 18:44:26'),
(24, 'Daftar 96', 8000, '2022-10-11 18:44:30', '2022-10-11 18:44:30', '2022-10-11 18:44:30'),
(25, 'Daftar 96', 8000, '2022-10-11 18:44:39', '2022-10-11 18:44:39', '2022-10-11 18:44:39'),
(26, 'Daftar 96', 8000, '2022-10-11 18:44:56', '2022-10-11 18:44:56', '2022-10-11 18:44:56'),
(27, 'Daftar 96', 8000, '2022-10-11 18:45:11', '2022-10-11 18:45:11', '2022-10-11 18:45:11'),
(28, 'Daftar 96', 8000, '2022-10-11 18:45:17', '2022-10-11 18:45:17', '2022-10-11 18:45:17'),
(29, 'Daftar 96', 8000, '2022-10-11 18:52:48', '2022-10-11 18:52:48', '2022-10-11 18:52:48'),
(30, 'Daftar 96', 8000, '2022-10-11 18:53:00', '2022-10-11 18:53:00', '2022-10-11 18:53:00'),
(31, 'Daftar 96', 8000, '2022-10-11 18:53:02', '2022-10-11 18:53:02', '2022-10-11 18:53:02'),
(32, 'Daftar 96', 8000, '2022-10-11 18:53:29', '2022-10-11 18:53:29', '2022-10-11 18:53:29'),
(33, 'Daftar 96', 8000, '2022-10-11 18:54:10', '2022-10-11 18:54:10', '2022-10-11 18:54:10'),
(34, 'Daftar 96', 8000, '2022-10-11 18:54:28', '2022-10-11 18:54:28', '2022-10-11 18:54:28'),
(35, 'Daftar 96', 8000, '2022-10-11 18:54:45', '2022-10-11 18:54:45', '2022-10-11 18:54:45'),
(36, 'Daftar 96', 8000, '2022-10-11 18:55:09', '2022-10-11 18:55:09', '2022-10-11 18:55:09'),
(37, 'Daftar 96', 8000, '2022-10-11 18:55:21', '2022-10-11 18:55:21', '2022-10-11 18:55:21'),
(38, 'Daftar 96', 8000, '2022-10-11 19:01:54', '2022-10-11 19:01:54', '2022-10-11 19:01:54'),
(39, 'Daftar 96', 8000, '2022-10-11 19:02:04', '2022-10-11 19:02:04', '2022-10-11 19:02:04'),
(40, 'Daftar 96', 8000, '2022-10-11 19:02:28', '2022-10-11 19:02:28', '2022-10-11 19:02:28'),
(41, 'Daftar 96', 8000, '2022-10-11 19:02:30', '2022-10-11 19:02:30', '2022-10-11 19:02:30'),
(42, 'Daftar 96', 8000, '2022-10-11 19:02:32', '2022-10-11 19:02:32', '2022-10-11 19:02:32'),
(43, 'Daftar 96', 8000, '2022-10-11 19:02:38', '2022-10-11 19:02:38', '2022-10-11 19:02:38'),
(44, 'Daftar 96', 8000, '2022-10-12 09:00:00', '2022-10-12 09:00:00', '2022-10-12 09:00:00'),
(45, 'Daftar 96', 8000, '2022-10-12 09:00:44', '2022-10-12 09:00:44', '2022-10-12 09:00:44'),
(46, '', 8000, '2022-10-12 09:08:36', '2022-10-12 09:08:36', '2022-10-12 09:08:36'),
(47, 'Kraska', 9200, '2022-10-12 11:41:17', '2022-10-12 11:41:17', '2022-10-12 11:41:17'),
(48, 'Ruchka 833', 75000, '2022-10-12 11:43:47', '2022-10-12 11:43:47', '2022-10-12 11:43:47');

-- --------------------------------------------------------

--
-- Структура таблицы `subjects`
--

CREATE TABLE `subjects` (
  `id` int(5) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `description` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT для таблицы `subjects`
--
ALTER TABLE `subjects`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
